In [2]:
import seaborn as sns
import pandas as pd
import numpy as np

In [3]:
#?sns.load_dataset()
df = sns.load_dataset("diamonds")
df

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [4]:
#############################################################################################################################################################################################################

In [5]:
df.shape

(53940, 10)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 53940 entries, 0 to 53939
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   carat    53940 non-null  float64
 1   cut      53940 non-null  category
 2   color    53940 non-null  category
 3   clarity  53940 non-null  category
 4   depth    53940 non-null  float64
 5   table    53940 non-null  float64
 6   price    53940 non-null  int64
 7   x        53940 non-null  float64
 8   y        53940 non-null  float64
 9   z        53940 non-null  float64
dtypes: category(3), float64(6), int64(1)
memory usage: 3.0 MB

In [7]:
########################################################################################################################################################

In [8]:
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [9]:
df.mean()

/tmp/ipykernel_4936/3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

carat       0.797940
depth      61.749405
table      57.457184
price    3932.799722
x           5.731157
y           5.734526
z           3.538734
dtype: float64

In [10]:
df["price"].mean()

3932.799721913237

In [11]:
df.median()

/tmp/ipykernel_4936/530051474.py:1: FutureWarning: The default value of numeric_only in DataFrame.median is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.median()

carat       0.70
depth      61.80
table      57.00
price    2401.00
x           5.70
y           5.71
z           3.53
dtype: float64

In [12]:
df.count()

carat      53940
cut        53940
color      53940
clarity    53940
depth      53940
table      53940
price      53940
x          53940
y          53940
z          53940
dtype: int64

In [13]:
df.min()

/tmp/ipykernel_4936/3962516015.py:1: FutureWarning: The default value of numeric_only in DataFrame.min is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.min()

carat      0.2
depth     43.0
table     43.0
price    326.0
x          0.0
y          0.0
z          0.0
dtype: float64

In [14]:
df.max()

/tmp/ipykernel_4936/1151452817.py:1: FutureWarning: The default value of numeric_only in DataFrame.max is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.max()

carat        5.01
depth       79.00
table       95.00
price    18823.00
x           10.74
y           58.90
z           31.80
dtype: float64

In [15]:
#standart sapma
df.std()

/tmp/ipykernel_4936/1940472707.py:2: FutureWarning: The default value of numeric_only in DataFrame.std is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.std()

carat       0.474011
depth       1.432621
table       2.234491
price    3989.439738
x           1.121761
y           1.142135
z           0.705699
dtype: float64

In [16]:
#varyans
df.var()

/tmp/ipykernel_4936/1866002976.py:2: FutureWarning: The default value of numeric_only in DataFrame.var is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.var()

carat    2.246867e-01
depth    2.052404e+00
table    4.992948e+00
price    1.591563e+07
x        1.258347e+00
y        1.304472e+00
z        4.980109e-01
dtype: float64

In [17]:
df["carat"].sum()

43040.869999999995

In [18]:
df.describe()

,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [19]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
carat,53940.0,0.797940,0.474011,0.2,0.40,0.70,1.04,5.01
depth,53940.0,61.749405,1.432621,43.0,61.00,61.80,62.50,79.00
table,53940.0,57.457184,2.234491,43.0,56.00,57.00,59.00,95.00
price,53940.0,3932.799722,3989.439738,326.0,950.00,2401.00,5324.25,18823.00
x,53940.0,5.731157,1.121761,0.0,4.71,5.70,6.54,10.74
y,53940.0,5.734526,1.142135,0.0,4.72,5.71,6.54,58.90
z,53940.0,3.538734,0.705699,0.0,2.91,3.53,4.04,31.80

In [20]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
carat,53940.0,0.797940,0.474011,0.2,0.40,0.70,1.04,5.01
depth,53940.0,61.749405,1.432621,43.0,61.00,61.80,62.50,79.00
table,53940.0,57.457184,2.234491,43.0,56.00,57.00,59.00,95.00
price,53940.0,3932.799722,3989.439738,326.0,950.00,2401.00,5324.25,18823.00
x,53940.0,5.731157,1.121761,0.0,4.71,5.70,6.54,10.74
y,53940.0,5.734526,1.142135,0.0,4.72,5.71,6.54,58.90
z,53940.0,3.538734,0.705699,0.0,2.91,3.53,4.04,31.80

In [21]:
##########################################################################################################################################

In [22]:
df=sns.load_dataset("planets")
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   object
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [24]:
df["method"]=pd.Categorical(df["method"])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   method          1035 non-null   category
 1   number          1035 non-null   int64
 2   orbital_period  992 non-null    float64
 3   mass            513 non-null    float64
 4   distance        808 non-null    float64
 5   year            1035 non-null   int64
dtypes: category(1), float64(3), int64(2)
memory usage: 41.9 KB

In [25]:
####################################################################################################################################################################################################################################

In [26]:
df["method"].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [27]:
df["method"].unique()

['Radial Velocity', 'Imaging', 'Eclipse Timing Variations', 'Transit', 'Astrometry', 'Transit Timing Variations', 'Orbital Brightness Modulation', 'Microlensing', 'Pulsar Timing', 'Pulsation Timing Variations']
Categories (10, object): ['Astrometry', 'Eclipse Timing Variations', 'Imaging', 'Microlensing', ..., 'Pulsation Timing Variations', 'Radial Velocity', 'Transit', 'Transit Timing Variations']

In [28]:
df["method"].nunique()

10

In [29]:
df["distance"].value_counts(dropna=False)

NaN       227
780.00      7
613.00      6
12.83       6
303.00      6
         ...
99.40       1
18.21       1
37.78       1
20.98       1
293.00      1
Name: distance, Length: 553, dtype: int64

In [30]:
df.distance.isnull().sum()

227

In [31]:
df.groupby("method")

In [32]:
df.groupby("method").mean()

,number,orbital_period,mass,distance,year
method,,,,,
Astrometry,1.000000,631.180000,NaN,17.875000,2011.500000
Eclipse Timing Variations,1.666667,4751.644444,5.125000,315.360000,2010.000000
Imaging,1.315789,118247.737500,NaN,67.715937,2009.131579
Microlensing,1.173913,3153.571429,NaN,4144.000000,2009.782609
Orbital Brightness Modulation,1.666667,0.709307,NaN,1180.000000,2011.666667
Pulsar Timing,2.200000,7343.021201,NaN,1200.000000,1998.400000
Pulsation Timing Variations,1.000000,1170.000000,NaN,NaN,2007.000000
Radial Velocity,1.721519,823.354680,2.630699,51.600208,2007.518987
Transit,1.954660,21.102073,1.470000,599.298080,2011.236776
Transit Timing Variations,2.250000,79.783500,NaN,1104.333333,2012.500000

In [33]:
df.groupby("method")["distance"]

In [34]:
df.groupby("method")[["distance","year"]].mean()

                                  distance         year
method
Astrometry                       17.875000  2011.500000
Eclipse Timing Variations       315.360000  2010.000000
Imaging                          67.715937  2009.131579
Microlensing                   4144.000000  2009.782609
Orbital Brightness Modulation  1180.000000  2011.666667
Pulsar Timing                  1200.000000  1998.400000
Pulsation Timing Variations            NaN  2007.000000
Radial Velocity                  51.600208  2007.518987
Transit                         599.298080  2011.236776
Transit Timing Variations      1104.333333  2012.500000

In [35]:
df.groupby("year")[["number"]].sum()

      number
year
1989       1
1992       6
1994       3
1995       1
1996      15
1997       1
1998      11
1999      24
2000      27
2001      15
2002      46
2003      35
2004      41
2005      64
2006      43
2007      65
2008     120
2009     131
2010     193
2011     354
2012     258
2013     277
2014     117

In [36]:
df[df["year"]==1992]

            method  number  orbital_period  mass  distance  year
941  Pulsar Timing       3         25.2620   NaN       NaN  1992
942  Pulsar Timing       3         66.5419   NaN       NaN  1992

In [37]:
df.groupby("method")["distance"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,17.875000,4.094148,14.98,16.4275,17.875,19.3225,20.77
Eclipse Timing Variations,4.0,315.360000,213.203907,130.72,130.7200,315.360,500.0000,500.00
Imaging,32.0,67.715937,53.736817,7.69,22.1450,40.395,132.6975,165.00
Microlensing,10.0,4144.000000,2076.611556,1760.00,2627.5000,3840.000,4747.5000,7720.00
Orbital Brightness Modulation,2.0,1180.000000,0.000000,1180.00,1180.0000,1180.000,1180.0000,1180.00
Pulsar Timing,1.0,1200.000000,NaN,1200.00,1200.0000,1200.000,1200.0000,1200.00
Pulsation Timing Variations,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Radial Velocity,530.0,51.600208,45.559381,1.35,24.4125,40.445,59.2175,354.00
Transit,224.0,599.298080,913.876990,38.00,200.0000,341.000,650.0000,8500.00
Transit Timing Variations,3.0,1104.333333,915.819487,339.00,597.0000,855.000,1487.0000,2119.00

In [38]:
####################################################################################################################################################

In [39]:
df=pd.DataFrame({"groups" : "x y z x y z".split(),
              "val1" : [2,15,25,14,3,91],
              "val2" : [92,245,325,254,103,961]})
df

  groups  val1  val2
0      x     2    92
1      y    15   245
2      z    25   325
3      x    14   254
4      y     3   103
5      z    91   961

In [40]:
df.groupby("groups").mean()

        val1   val2
groups
x        8.0  173.0
y        9.0  174.0
z       58.0  643.0

In [41]:
df.groupby("groups").aggregate(["mean",np.median,min,"sum"])

        val1                   val2
        mean median min  sum   mean median  min   sum
groups
x        8.0    8.0   2   16  173.0  173.0   92   346
y        9.0    9.0   3   18  174.0  174.0  103   348
z       58.0   58.0  25  116  643.0  643.0  325  1286

In [42]:
df.groupby("groups").aggregate({"val1":"mean","val2":"median"})

        val1   val2
groups
x        8.0  173.0
y        9.0  174.0
z       58.0  643.0

In [43]:
####################################################################################################################################################

In [44]:
def ex(x):
    return x["val2"].mean()<200
df.groupby("groups").mean()

        val1   val2
groups
x        8.0  173.0
y        9.0  174.0
z       58.0  643.0

In [45]:
df.groupby("groups").filter(ex)

  groups  val1  val2
0      x     2    92
1      y    15   245
3      x    14   254
4      y     3   103

In [47]:
df.groupby("groups").std

In [50]:
df.groupby("groups").filter(lambda x : x["val2"].std()>105)

  groups  val1  val2
0      x     2    92
2      z    25   325
3      x    14   254
5      z    91   961

In [51]:
###################################################################################################################################

In [53]:
df

  groups  val1  val2
0      x     2    92
1      y    15   245
2      z    25   325
3      x    14   254
4      y     3   103
5      z    91   961

In [55]:
df_new=df.loc[:,"val1":"val2"]
df_new

   val1  val2
0     2    92
1    15   245
2    25   325
3    14   254
4     3   103
5    91   961

In [57]:
def normal(x):
    return (x-x.min()) / (x.max()-x.min())
df_new.transform(normal)

       val1      val2
0  0.000000  0.000000
1  0.146067  0.176064
2  0.258427  0.268124
3  0.134831  0.186421
4  0.011236  0.012658
5  1.000000  1.000000

In [58]:
################################################################################################################################################################################################################################################

In [64]:
df.apply(np.sum)

groups    xyzxyz
val1         150
val2        1980
dtype: object

In [69]:
df_new=df.loc[:,"val1":"val2"]
df

  groups  val1  val2
0      x     2    92
1      y    15   245
2      z    25   325
3      x    14   254
4      y     3   103
5      z    91   961

In [71]:
df_new.apply(np.mean)

val1     25.0
val2    330.0
dtype: float64

In [73]:
df_new.apply(np.mean,axis=1)

0     47.0
1    130.0
2    175.0
3    134.0
4     53.0
5    526.0
dtype: float64

In [75]:
df.groupby("groups").apply(np.mean)

/home/barbaros/.local/lib/python3.10/site-packages/numpy/core/fromnumeric.py:3430: FutureWarning: In a future version, DataFrame.mean(axis=None) will return a scalar mean over the entire DataFrame. To retain the old behavior, use 'frame.mean(axis=0)' or just 'frame.mean()'
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)
/home/barbaros/.local/lib/python3.10/site-packages/numpy/core/fromnumeric.py:3430: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  return mean(axis=axis, dtype=dtype, out=out, **kwargs)

        val1   val2
groups
x        8.0  173.0
y        9.0  174.0
z       58.0  643.0

In [78]:
df2=pd.DataFrame({"val1":[2,4,6,8,10],
                  "val2":"Turkey UK Australia Philipines Egypt".split()})
df2

   val1        val2
0     2      Turkey
1     4          UK
2     6   Australia
3     8  Philipines
4    10       Egypt

In [83]:
def kup(x):
    return x**3
df2.val1.apply(kup)

0       8
1      64
2     216
3     512
4    1000
Name: val1, dtype: int64

In [85]:
df2.val2.apply(len)

0     6
1     2
2     9
3    10
4     5
Name: val2, dtype: int64